Repository: macsimoff/password-for-us
Catalog: PasswordForUs/Resources/Resources.*.resx
Languages: ru_ru

# WelcomeMessage
source: --PasswordForUs started
ru_ru: Программа PasswordForUs запущена

# OpenFilePrompt
source: You need to open(o) or to import(i) the file with stored passwords.
ru_ru: Вам необходимо открыть(o) или импортировать(i) файл с паролями.

# Add_AddPassword
source: Password was added in storage.
ru_ru: Пароль был добавлен в хранилище.

# Add_EnterLoginPrompt
source: Enter Login:
ru_ru: Введите логин:

# Add_AdditionalDataPrompt
source: Enter additional data format --<key> <value> write 'end' or empty string for finish:
ru_ru: Введите дополнительные данные формат --<ключ> <значение> напишите 'end' или пустую строку для завершения:

# Add_EnterPasswordPrompt
source: enter PASSWORD or enter Y/y to generate password automate:
ru_ru: Введите ПАРОЛЬ или введите Y/y для автоматической генерации пароля:

# Add_EnterURLPrompt
source: enter URL address:
ru_ru: Введите URL-адрес:

# Base_SynchronizationCompleted
source: Synchronization completed.
ru_ru: Синхронизация завершена.

# ChangePass_ThereAreMoreThanOne
source: There are more than one entry with the specified ID. Please, specify the search criteria.
ru_ru: Существует более одной записи с указанным ID. Уточните критерии поиска.

# ChangePass_ThereIsNoEntry
source: There is no entry with the specified ID.
ru_ru: Запись с указанным ID отсутствует.

# ChangePass_PasswordChanged
source: Password was changed.
ru_ru: Пароль был изменён.

# Delete_PasswordDeleted
source: Password was deleted.
ru_ru: Пароль был удалён.

# Empty_TryingToExecute
source: The program is trying to execute an empty command - something is wrong!
ru_ru: Программа пытается выполнить пустую команду - что-то пошло не так!

# FindCommand_TryingToFind
source: Trying to find ID:{0} URL:{1} Name:{3}...
ru_ru: Попытка найти ID:{0} URL:{1} Имя:{3}...

# FindCommand_NotFound
source: The program didn't find anything.
ru_ru: Программа ничего не нашла.

# FindCommand_Done
source: done
ru_ru: готово

# GeneratePass_GeneratePass
source: Generated Password: {0}
ru_ru: Сгенерированный пароль: {0}

# Import_End
source: End import command.
ru_ru: Команда импорта завершена.

# Import_FileParsed
source: File has been parsed.
ru_ru: Файл был обработан.

# Open_FileOpened
source: The password file has been opened.
ru_ru: Файл с паролями был открыт.

# SetPass_WritePromt
source: Write password please:
ru_ru: Введите пароль:

# SetPass_IsEmpty
source: Password is empty.
ru_ru: Пароль пуст.

# SetPass_HashIterationPromt
source: Write hash iteration for password please:
ru_ru: Введите количество итераций хэширования для пароля:

# SetPass_InvalidInputInteger
source: Invalid input. Please enter a positive integer.
ru_ru: Неверный ввод. Пожалуйста, введите положительное целое число.

# SetSettings_Success
source: Settings updated successfully.
ru_ru: Настройки успешно обновлены.

# ShowSettings_CurrentSettings
source: Current Settings:
ru_ru: Текущие настройки:
