Repository: macsimoff/password-for-us
Catalog: pw4us/Resources/DescriptionResources.*.resx
Languages: ru

# GeneratePassCommand
source: Generate a random password
ru: Генерирует случайный пароль

# GPC_Length
source: Length of the password to generate
ru: Устанавливает длинну пароля

# LogSettings_LogFile
source: Path and file name for logging
ru: Путь и имя файла для логирования

# LogSettings_LogLevel
source: Minimum level for logging
ru: Минимальный уровень логирования

# FindCommand
source: find a record in the storage by name, URL, or ID
ru: найти запись в хранилище по имени, URL или идентификатору

# FC_Id
source: key of the record in the storage
ru: ключ записи в хранилище

# FC_Url
source: url is contained in a storage record
ru: url содержащийся в записи

# FC_Name
source: name or part of name in the record
ru: имя записи или его часть

# CreateCommand
source: create a new entry to the storage
ru: создаем новую запись в хранилище

# IC_Path
source: path to the file to import
ru: путь к файлу для импорта

# IC_Format
source: file format (txt/home, json, csv). Default: by file extension
ru: формат файла (txt/home, json, csv). По умолчанию — по расширению
